{
  "AppIntro": {
    "welcomeTitle": "स्पॉटहोल में आपका स्वागत है!",
    "welcomeSubtitle": "गड्ढों की रिपोर्ट करने और सभी के लिए सड़क सुरक्षा में सुधार करने के लिए एक समुदाय-संचालित मंच।",
    "step1Title": "१. एक गड्ढा खोजें",
    "step1Subtitle": "एक गड्ढा ढूंढें जिसे ठीक करने की आवश्यकता है।",
    "step2Title": "२. एक फोटो लें",
    "step2Subtitle": "एक स्पष्ट, जियोटैग की हुई तस्वीर लें।",
    "step3Title": "३. मानचित्र पर अपलोड करें",
    "step3Subtitle": "इसे मानचित्र पर डालने में हमारी सहायता करें ताकि सभी देख सकें।",
    "motto": "साथ मिलकर, हम अपनी सड़कों को सुरक्षित बना सकते हैं।",
    "buttonText": "चलिए!"
  },
  "HomePage": {
    "reportButton": "गड्ढे की रिपोर्ट करें"
  },
  "UploadDisclaimer": {
    "title": "अपलोड करने से पहले...",
    "description": "गड्ढे को सटीक रूप से मैप करने के लिए, हमें स्थान डेटा (जियोटैग) वाली एक तस्वीर चाहिए। कृपया सुनिश्चित करें कि तस्वीर लेने से पहले यह आपकी कैमरा सेटिंग्स में सक्षम है।",
    "agreeButton": "मैं समझ गया, जारी रखें",
    "rule1": "कृपया <bold>केवल गड्ढों की स्पष्ट तस्वीरें</bold> अपलोड करें। कोई भी NSFW, आपत्तिजनक, या असंबंधित सामग्री नहीं।",
    "rule2": "चेहरे, लाइसेंस प्लेट, या घर के नंबर जैसी व्यक्तिगत जानकारी से बचें।",
    "privacyAssuredTitle": "आपकी गोपनीयता सुनिश्चित है",
    "privacyAssuredContent": "सभी स्थान डेटा और व्यक्तिगत मेटाडेटा छवियों से स्वचालित रूप से हटा दिए जाते हैं। आपके अपलोड पूरी तरह से गुमनाम हैं।"
  },
  "Header": {
    "title": "स्पॉटहोल"
  },
  "UploadPage": {
    "title": "अपने गड्ढे की तस्वीर अपलोड करें",
    "geotagInfo": "आपके द्वारा अपलोड की गई छवियों को जियोटैग होना चाहिए। इससे हमें मानचित्र पर आपकी प्रविष्टि को उचित रूप से रखने में मदद मिलेगी। यदि आपको इसमें सहायता चाहिए, तो कृपया नीचे दिए गए FAQ देखें।",
    "dropzone": "अपलोड करने के लिए क्लिक करें या खींचें और छोड़ें",
    "acceptedFiles": "स्वीकृत: jpeg, jpg",
    "uploading": "अपलोड हो रहा है...",
    "errorInvalidType": "अमान्य फ़ाइल प्रकार। कृपया एक JPEG या JPG छवि अपलोड करें।",
    "errorNoGeotag": "छवि जियोटैग नहीं है। कृपया अपनी कैमरा सेटिंग्स में जियोटैगिंग सक्षम करें।",
    "errorPresignedUrl": "पूर्व-हस्ताक्षरित यूआरएल प्राप्त करने में विफल।",
    "errorS3Upload": "S3 पर अपलोड करने में विफल।",
    "errorDbSave": "गड्ढे का डेटा सहेजने में विफल।",
    "errorUnknown": "एक अज्ञात त्रुटि हुई।",
    "faqTitle1": "मैं अपने आईफोन पर जियोटैगिंग कैसे सक्षम करूं?",
    "faqContent1": "आईफोन पर जियोटैगिंग सक्षम करने के लिए, सेटिंग्स > गोपनीयता > स्थान सेवाएं पर जाएं। सुनिश्चित करें कि स्थान सेवाएं चालू हैं। फिर, कैमरा तक स्क्रॉल करें, उस पर टैप करें, और \"ऐप का उपयोग करते समय\" चुनें।",
    "faqTitle2": "मैं अपने एंड्रॉइड फोन पर जियोटैगिंग कैसे सक्षम करूं?",
    "faqContent2": "एंड्रॉइड फोन पर जियोटैगिंग सक्षम करने के लिए, कैमरा ऐप सेटिंग्स खोलें। \"लोकेशन टैग,\" \"जियोटैग,\" या इसी तरह के विकल्प की तलाश करें, और सुनिश्चित करें कि यह सक्षम है। सटीक चरण आपके फोन के निर्माता के आधार पर थोड़े भिन्न हो सकते हैं।",
    "faqTitle3": "यह मंच कौन चलाता है?",
    "faqContent3": "यह सभी के लिए सड़क सुरक्षा में सुधार के लिए बनाया गया एक समुदाय-संचालित मंच है। इसे आदेश कुलकर्णी द्वारा विकसित और रखरखाव किया जाता है। आप उनसे लिंक्डइन पर संपर्क कर सकते हैं।"
  }
}
